In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### 컬럼
#### 컬럼 추가

In [3]:
df['Age_Kor'] = df['Age'] +1
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Kor
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,23.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,39.0

- Age, Age_kor / 상위 5개

In [7]:
df[['Age', 'Age_Kor']].head(5)

    Age  Age_Kor
0  22.0     23.0
1  38.0     39.0
2  26.0     27.0
3  35.0     36.0
4  35.0     36.0

In [14]:
df['new_col_1'] = df['Age'] + df['Fare']
df[['Age', 'Fare', 'new_col_1']].head(5)

    Age     Fare  new_col_1
0  22.0   7.2500    29.2500
1  38.0  71.2833   109.2833
2  26.0   7.9250    33.9250
3  35.0  53.1000    88.1000
4  35.0   8.0500    43.0500

In [15]:
df[(df['Age'] + df['Fare']) != (df['new_col_1'])] [['Age', 'Fare', 'new_col_1']]

     Age     Fare  new_col_1
5    NaN   8.4583        NaN
17   NaN  13.0000        NaN
19   NaN   7.2250        NaN
26   NaN   7.2250        NaN
28   NaN   7.8792        NaN
..   ...      ...        ...
859  NaN   7.2292        NaN
863  NaN  69.5500        NaN
868  NaN   9.5000        NaN
878  NaN   7.8958        NaN
888  NaN  23.4500        NaN

[177 rows x 3 columns]

In [16]:
df['new_col_2'] = np.nan
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Kor,new_col_1,new_col_2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,23.0,29.2500,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,39.0,109.2833,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,27.0,33.9250,NaN

#### 컬럼 변경

In [19]:
df['new_col_2'] = 2
df[['new_col_2']].head(3)

    Age  new_col_2
0  22.0          2
1  38.0          2
2  26.0          2

In [21]:
df['new_col_2'] = df['Age'] + 10
df[['Age', 'new_col_2']].head(3)

    Age  new_col_2
0  22.0       32.0
1  38.0       48.0
2  26.0       36.0

In [31]:
# drop
#df.drop('Age_Kor', axis=1, inplace=True)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'new_col_1',
       'new_col_2'],
      dtype='object')

In [32]:
'Age_Kor' in df.columns

False

In [33]:
del df['new_col_2']
'new_col_2' in df.columns

False

In [35]:
df.drop(['Cabin', 'Embarked'], axis=1).columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'new_col_1'],
      dtype='object')

In [37]:
del [ df['Cabin'] , df['Embarked'] ]
df.columns

KeyError: 'Cabin'

In [38]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'new_col_1'],
      dtype='object')

### Data(row)

#### data(row) 추가
- list
- dictionary

In [74]:
df = pd.read_csv('./train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [75]:
df.shape

(891, 12)

- list 추가

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [77]:
list_891 = [1, 1, 1, 'a', 'male', 70.0, 1, 0, 'b', 1, 'c', 'd']
df.loc[891] = list_891
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
891,1,1,1,a,male,70.0,1,0,b,1.00,c,d

In [78]:
dic_892 = {'PassengerId':1, 'Survived':1, 'Pclass':2, 'Name':'g', 'Sex': 'female', 'Age':68.0, 'SibSp':1, 'Parch':0, 'Ticket':'h', 'Fare':1, 'Cabin':'j', 'Embarked':'k'}
df.loc[892] = dic_892
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
891,1,1,1,a,male,70.0,1,0,b,1.00,c,d
892,1,1,2,g,female,68.0,1,0,h,1.00,j,k

#### data(row)변경

In [79]:
df.loc[1] = list_891
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [80]:
df.loc[3] = dic_892
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,1,1,2,g,female,68.0,1,0,h,1.000,j,k

#### data(row)삭제

In [59]:
# axis = 0이 default
df.drop(892, axis=0, implace=True)
df.tail(2)

TypeError: drop() got an unexpected keyword argument 'implace'

### 특정 data 변경

In [81]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [82]:
df.loc[2, 'Name'] = 'No name'
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1,0,b,1.000,c,d
2,3,1,3,No name,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 893 entries, 0 to 892
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  893 non-null    int64
 1   Survived     893 non-null    int64
 2   Pclass       893 non-null    int64
 3   Name         893 non-null    object
 4   Sex          893 non-null    object
 5   Age          716 non-null    float64
 6   SibSp        893 non-null    int64
 7   Parch        893 non-null    int64
 8   Ticket       893 non-null    object
 9   Fare         893 non-null    float64
 10  Cabin        206 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 123.0+ KB

- 나이가 70 넘으신 분의 나이를 0으로 변경

In [96]:
df[df['Age']> 70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [108]:
df.loc[df['Age'] > 70, 'Age']= 0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.250,NaN,S
1,1,1,1,a,male,70.0,1.0,0,b,1.000,c,d
2,3,1,3,No name,female,26.0,0.0,0,STON/O2. 3101282,7.925,NaN,S
3,1,1,2,g,female,68.0,1.0,0,h,1.000,j,k
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.050,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.750,NaN,Q
891,1,1,1,a,male,70.0,1.0,0,b,1.000,c,d
892,1,1,2,g,female,68.0,1.0,0,h,1.000,j,k

### 컬럼 타입/ 명 변경
- astype
    - implace option이 없음
- 변경할 컬럼의 data중 nan이 없으면

In [110]:
df = df.astype({'SibSp':'float'})
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 893 entries, 0 to 892
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  893 non-null    int64
 1   Survived     893 non-null    int64
 2   Pclass       893 non-null    int64
 3   Name         893 non-null    object
 4   Sex          893 non-null    object
 5   Age          716 non-null    float64
 6   SibSp        893 non-null    float64
 7   Parch        893 non-null    int64
 8   Ticket       893 non-null    object
 9   Fare         893 non-null    float64
 10  Cabin        206 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(3), int64(4), object(5)
memory usage: 123.0+ KB

In [113]:
df = df.astype({'Age': 'int'})
df.info()

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer